In [324]:
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
%matplotlib inline

In [325]:
import datetime

In [326]:
today_date=datetime.datetime.today()

In [327]:
days=[today_date-datetime.timedelta(x) for x in range(1,15)]

In [328]:
data=pd.DataFrame(days)

In [329]:
data.columns=['date']

In [330]:
data['weekdays']=data['date'].dt.day_name()

In [331]:
data.head()

                        date  weekdays
0 2021-01-05 17:05:56.187173   Tuesday
1 2021-01-04 17:05:56.187173    Monday
2 2021-01-03 17:05:56.187173    Sunday
3 2021-01-02 17:05:56.187173  Saturday
4 2021-01-01 17:05:56.187173    Friday

In [332]:
dictionary={
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
    
}

In [333]:
data['week_rank']=data['weekdays'].map(dictionary)

In [334]:
data.head(10)

                        date   weekdays  week_rank
0 2021-01-05 17:05:56.187173    Tuesday          2
1 2021-01-04 17:05:56.187173     Monday          1
2 2021-01-03 17:05:56.187173     Sunday          7
3 2021-01-02 17:05:56.187173   Saturday          6
4 2021-01-01 17:05:56.187173     Friday          5
5 2020-12-31 17:05:56.187173   Thursday          4
6 2020-12-30 17:05:56.187173  Wednesday          3
7 2020-12-29 17:05:56.187173    Tuesday          2
8 2020-12-28 17:05:56.187173     Monday          1
9 2020-12-27 17:05:56.187173     Sunday          7

## Count Encoding

In [335]:
df=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None,index_col=None)

In [336]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [337]:
columns=[1,3,5,6,7,8,13]

In [338]:
df=df[columns]

In [339]:
df.head()

,1,3,5,6,7,8,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Cuba

In [340]:
df.columns=['Job','Degree','Status','designation','Family','Race','Country']

In [341]:
df.head()

,Job,Degree,Status,designation,Family,Race,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Cuba

In [342]:
df.Country.unique()

array([' United-States', ' Cuba', ' Jamaica', ' India', ' ?', ' Mexico',
       ' South', ' Puerto-Rico', ' Honduras', ' England', ' Canada',
       ' Germany', ' Iran', ' Philippines', ' Italy', ' Poland',
       ' Columbia', ' Cambodia', ' Thailand', ' Ecuador', ' Laos',
       ' Taiwan', ' Haiti', ' Portugal', ' Dominican-Republic',
       ' El-Salvador', ' France', ' Guatemala', ' China', ' Japan',
       ' Yugoslavia', ' Peru', ' Outlying-US(Guam-USVI-etc)', ' Scotland',
       ' Trinadad&Tobago', ' Greece', ' Nicaragua', ' Vietnam', ' Hong',
       ' Ireland', ' Hungary', ' Holand-Netherlands'], dtype=object)

In [343]:
di=df.Country.value_counts().to_dict()

In [344]:
df['Country']=df['Country'].map(di)

In [345]:
df.head()

,Job,Degree,Status,designation,Family,Race,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,95

### Target Encoding

In [346]:
da=sb.load_dataset('titanic')

In [347]:
da.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [348]:
columns=['deck','survived']

In [349]:
da=da[columns]

In [350]:
da.head()

  deck  survived
0  NaN         0
1    C         1
2  NaN         1
3    C         1
4  NaN         0

In [351]:



da['deck'] = da['deck'].astype('string')
da['deck'] = da['deck'].fillna('M')
da['deck'] = da['deck'].astype('category')

In [352]:
da['deck']=da['deck'].astype(str).str[0]

In [353]:
da.head()

  deck  survived
0    M         0
1    C         1
2    M         1
3    C         1
4    M         0

In [354]:
ordinal=da.groupby(['deck'])['survived'].mean().sort_values().index

In [355]:
label={ k:i for i,k in enumerate(ordinal ,0)}
label

{'M': 0, 'A': 1, 'G': 2, 'C': 3, 'F': 4, 'B': 5, 'E': 6, 'D': 7}

In [356]:
da['deck1']=da['deck'].map(label)

In [357]:
da.head()

  deck  survived  deck1
0    M         0      0
1    C         1      3
2    M         1      0
3    C         1      3
4    M         0      0

###  Mean Encoding

In [358]:
mean_encode=da.groupby(['deck'])['survived']

In [359]:
da['mean_encode']=da['deck'].map(mean_encode)

TypeError: 'SeriesGroupBy' object is not callable

In [360]:
da.head()

  deck  survived  deck1
0    M         0      0
1    C         1      3
2    M         1      0
3    C         1      3
4    M         0      0

### Probability Encoding

In [361]:
df=sb.load_dataset('titanic')
import pandas as pd

In [362]:
usecols=['survived','deck']
df=df[usecols]

In [363]:
df.head()

   survived deck
0         0  NaN
1         1    C
2         1  NaN
3         1    C
4         0  NaN

In [376]:
df['deck']=df ['deck'].astype('string')
df['deck']=df['deck'].fillna('Miss')
df['deck']=df['deck'].astype('category')

In [377]:
df['deck'] =df.deck.astype(str).str[0]

In [378]:
df.head()

   survived deck
0         0    M
1         1    C
2         1    M
3         1    C
4         0    M

In [367]:
pf=df.groupby(['deck'])['survived'].mean()

In [368]:
pf=pd.DataFrame(pf)

In [369]:
pf.head()

      survived
deck
A     0.466667
B     0.744681
C     0.593220
D     0.757576
E     0.750000

In [370]:
pf['died']=1-pf['survived']

In [371]:
pf['ratio']=pf['survived']/pf['died']

In [372]:
pf.head()

      survived      died     ratio
deck
A     0.466667  0.533333  0.875000
B     0.744681  0.255319  2.916667
C     0.593220  0.406780  1.458333
D     0.757576  0.242424  3.125000
E     0.750000  0.250000  3.000000

In [373]:
encode=pf.ratio.to_dict()

In [374]:
da['deck_prob']=da['deck'].map(encode)

In [375]:
da.head()

  deck  survived  deck1  deck_prob
0    M         0      0   0.427386
1    C         1      3   1.458333
2    M         1      0   0.427386
3    C         1      3   1.458333
4    M         0      0   0.427386